{
	"Reviews": [{
		"Author": "John Smith",
		"Date": "2018-07-11",
		"ShipName": "Norwegian Breakaway",
		"CruiseLine": "Norwegian Cruise Line",
		"Rating": 4,
		"Review": "We sailed from New York to the Bahamas and back during the Christmas period. Firstly the check in went wrong as my son had been booked with drinks package but he is only 17.. this causes havoc!! And took an hour to sort out whilst we stood there. We went straight for lunch when first boarding to the garden cafe which was busy noisy and then to our staterooms. We had an amazing guy looking after our rooms.. so friendly and accommodating called Benedict. On booking we had been told we had free wifi which we then found out was limited which caused no end of problems between my children!! Sad I know but my husband needed wifi for work too. The Internet cafe didn't work out either. In the free dining restaurants the menus were all the same which was most disappointing as we are vegetarians and they only had one choice per night. We were well looked after though but served meat on the last night by accident. Christmas Day was really disappointing too there wasn't a roast potato in sight apart from garlic diced ones."
	},
	{
		"Author": "Jane Evans",
		"Date": "2018-04-01",
		"ShipName": "Norwegian Eclipse",
		"CruiseLine": "Norwegian Cruise Line",
		"Rating": 5,
		"Review": "The ship was lovely lots going for it. Cabin nice also very clean ship. Bars and restaurants done out very nice and cosy. Downside to these type of ships they are getting to big and having to cue up for everything. Never cruised with NCL before, all they kept pushing is to gamble and spend more money on different things. Having spent a lot of money on getting all the extras like balcony, paying for granites upfront also drinks package which does not include water which I find hard except. Also having to pay extra in the other restaurants which were empty if they just included it with the price I think there would have not been so many cues all the time to eat."
	},
	{
		"Author": "Scott Thomson",
		"Date": "2018-05-12",
		"ShipName": "Ventura",
		"CruiseLine": "P&O",
		"Rating": 3,
		"Review": "Not as good as expected - could do better! Ventura - canary Island cruise 29/10/17 Super cabin - deluxe balcony with lounge, excellent cabin steward Enjoyed the quality and variety of the food Lisbon and Madera were lovely, took the tram ride and toboggan ride at these - very good (if not cheap) Generally poor service on ship (especially Saffron restaurant), staff looked disengaged, senior staff conspicuous in their absence around the ship Poor timing of entertainment in the evenings, lack of interesting daytime entertainment on sea days. Never once saw the hand rails being cleaned or staff enforcing hand sanitising - very worrying. Looks like I'll be returning to Thomson/TUI or whatever they are now calling themselves, as my previous four cruises with them were excellent"
	},
        {
		"Author": "Clive Dale",
		"Date": "2018-03-01",
		"ShipName": "Oriana",
		"CruiseLine": "P&O",
		"Rating": 1,
		"Review": "Sailed on P&O Oceana from June into July 2017. Fly cruise from Malta and sailed Central Med visiting Croatia, Italy and Greek Islands. I have sailed with P&O previously and was somewhat anxious having read some of the reviews about this ship before sailing. I had no reason to be. I joined the ship and despite a delayed flight the crew members got us on board as quickly as they could and without fuss. The itinerary was fine and although there were just two ports that I didn't enjoy, which I feel should not have been part of that itinerary it didn't spoil anything for me or for those travelling in my party. I understand the ship is due for a re-fit later this year and that may be necessary in some areas but overall I found the ship to be very clean, furniture more than comfortable and the staff very hardworking, polite and professional. The reports of furniture being threadbare and the ship looking tired and rusty were without foundation. The atrium is majestic and I spent some time during the early hours of one morning taking photographs of the interior of the ship and it was at this time I saw the cleaning staff working very hard to maintain its high standard of cleanliness. The restaurant was well run and I had no complaints about the food, indeed it was excellent and the waiters were more than willing to accommodate the needs of passengers. The buffet area was well run and out of 14 days I experienced only one day when it became a bit congested. The Beach House is a must and the food served from there was splendid..a great experience at a small additional charge. I had one bad experience on this ship during my holiday that involved us missing an excursion, which was the fault of a crew member. It certainly messed up our day but it didn't spoil the cruise. I would certainly recommend this ship to anyone. Do not be put off by any negative reviews you may read the Oceana is a lovely ship and I would cruise on it again without hesitation."
	},
        {
		"Author": "Sheila Davies",
		"Date": "2017-05-06",
		"ShipName": "Azura",
		"CruiseLine": "P&O",
		"Rating": 5,
		"Review": "We paid for a higher grade outside cabin D712, the arrangement of loo to shower left little space and was the most cramped we have ever encountered on any cruise ship. We could hear the rehearsals and shows from the starlights below, there was no mention of this in the brochure. This should be highlighted or cabin grade lowered. We have been on three P&O cruises were there has been a Nirovirus outbreak and we have always complained that the use of hand gels is not enforced. There was none available at embarkation and nobody policed it's use at the restaurants. It seems P&O are very relaxed about this until there is an outbreak, then they blame passengers even though many crew do not use hand gel on boarding ship. The entertainment on this 19 night cruise was the worst we have ever had. Headliners did only 2 shows the excuse being they were a new group. Well shouldn't they be trained on shore and be ready to go when they join the ship. We realise maintenance has to be done but we couldn't get all the way around prom deck on any if the 10 days. One night my wife was ill when we went to the theatre due to the overpowering smell of varnish."
	},
        {
		"Author": "Beryl Rennie",
		"Date": "2017-12-24",
		"ShipName": "MSC Fantastica",
		"CruiseLine": "MSC Cruises",
		"Rating": 4,
		"Review": "Arrived home after a 14 night cruise to the Canary Islands. The cruise itself was lovely. I was travelling with five other friends two of us wheelchair users one with a scooter. They organised accessable mini coach for each of our excursions which was excellent. However we have never ever had such poor service as we had in the dining room. Six of us shared a table and the first three nights in the dining room we had to complain about the quality of the food. Although the waiter said this would be reported nothing was done, on the fourth night I could not eat the lamb it was so tough, when the waiter removed it he didn't even make any comment, until I pointed out to him why I hadn't eaten it. After these disasterous meals we retreated to dining in the self service restaurant where our able bodies friends kindly waited on us. On asking around the ship many people had the same complaint. On the very last night we were visited by a senior staff member as he had read our survey and so we repeated our list of complaints he said he would look into the situation. As this was the 14 th night it seemed a bit late and we told him so. Since returning two of our friends have cancelled their future booking with PO...and I certainly will not use them again."
	},
        {
		"Author": "Rufus Proctor",
		"Date": "2018-07-13",
		"ShipName": "Costa Magnifica",
		"CruiseLine": "Costa Cruises",
		"Rating": 2,
		"Review": "Just returned from a 2 week fly cruise. Eastern Med and Adriatic. Great itinerary. Superb weather. Our first cruise with P&O having cruised with Cunard &Princess previously. Flight with BA and transfers were excellent as was embarcation or so we thought. Our key card opened the door to a cabin already occupied by a couple in bed and as unhappy to be disturbed as we were to disturb them. 3 hours later we were found a cabin of the same grade and one deck higher. No explanation was given for their error and no apology was given. I won't bore you with the cabin problems suffice it to say that we made 16 trips to reception with key cards which needed reprogramming and had 4 visits from officers to reprogram the lock. Our cards were not kept with other cards to demagnetise them or with mobile phones. For the last 3 days of the cruise our cabin steward took to leaving our door not closed as she too was having problems with the lock. As there is limited space in the cabin safe our possessions and the room was not secure. Our experience is that when thinks are going well then Oceana is a happy friendly ship giving value for money and a memorable holiday. When things go wrong it is as if P&O staff are unprepared to acknowledge the error or problem and imply the fault lies with the passenger. We are still waiting for an apology for the cabin double booking and the door lock problem. 55 mins is a long time to stand waiting outside a cabin when you have been told help is on the way. So despite most of our holiday being lovely we are unsure whether we would book with P&O again, which is a shame."
	},
        {
		"Author": "Tom Fullerton",
		"Date": "2018-02-08",
		"ShipName": "Azura",
		"CruiseLine": "P&O",
		"Rating": 3,
		"Review": "Just returned from a week on the Oceana, starting in Genoa and finishing in Venice, with stops in Livorno, Amalfi, Dubrovnik and a day in Venice. Had the best time ever on a fantastic ship, could not fault anything apart from the Wifi charges were a bit high. Staff were lovely and friendly, they could not do enough for you, entertainment was fabulous we saw some great shows every night. Food was lovely, we mainly used the Plaza buffet and the Ligurian, waiters in the Ligurian were great. Our cabin was on F deck with a window and was really nice, plenty of room and storage space. Excellent value for money and will hopefully be booking another cruise very soon."
	},
        {
		"Author": "Sharron Holmes",
		"Date": "2018-04-01",
		"ShipName": "Queen Mary 2",
		"CruiseLine": "Cunard",
		"Rating": 5,
		"Review": "Just returned from the Italian cruise. Loved every minute of it. Food crew and all staff were faultless. Have now booked the carribean cruise, can't wait!"
	},
        {
		"Author": "Recce Timmins",
		"Date": "2018-05-30",
		"ShipName": "Ventura",
		"CruiseLine": "P&O",
		"Rating": 5,
		"Review": "A bit of a delay with this review. We have just booked another cruise on Oceana next month so it couldn't have been that bad really! We had a 35 night cruise in Feb across the Atlantic. We had a terrible crossing Biscay in force 10 storm. Its true what other reviews are saying Oceana is tired, rust everywhere and frayed faded carpets. This didn't spoil our holiday one bit however. Our cabin was fine with some bathroom issues, the loo went out of action four times, the shower couldn't hold the temperature and was even worse after we reported it. Buckets in corridors catching water from the ceilings. We found the food/dining fine without fault. The buffet could get very crowded with very inconsiderate people. We found the entertainment fairly poor and flat, especially on sea days when an early morning stretch was the highlight! We thought the Headliners were poor ( the in house team) and didn't even bother to go to some of the shows. We liked the ship in general, the posts of call were very good. The crew were brilliant ( with the exception of one girl on the excursions team who was just unhelpful and rude, not just to us). Our fellow passengers were offish and seemed to think they something special ( some lovely exceptions) and we felt that at the time we would not be returning to P and O because of this. We have cruised with two other cruise lines and we felt this was the worst experience we had encountered. However and P and O are a very good price and their cruises have great ports of call. We have booked a Med cruise this time and really hope for a different experience this time, fingers crossed. Will let you know"
	}]
}
